var text = +prompt("Yoshingiz nechifa ?") // NaN  


 if(10 > text) {
    alert('салом кичкинтой!');
}
else if(18 > text){
    alert('салом мехмон!');
}
else if(110 > text) {
    alert('Салом дода!');
}
else if(isNaN(text)) {
    alert('Harif yozma son yoz!!!!');
}
else{
    alert('бунча йош яшалмиди!');
}









// | Клиентдат йошини сурашяпти криштан олдин 
// агар клиент йоши 10 дан кичик булса , ойнага 'салом кичкинтой' деб чикиш керак
// агар клиент йоши 18 кичик булса унда салом мехмон 
// агар клиент йоши 110 кичик булса Салом дода
// агар клиент йоши 110 баланд булса бунча йош яшалмиди 


